app/controllers/availability_controller.rb

  def search
    @available_rooms = Host.all.collect {
---
SELECT `hosts`.* FROM `hosts`